{
  "outfits": {
    "100_Outrider": {
      "name": "100% Outrider",
      "character": "Amber",
      "characters": ["Amber"],
      "rarity": 4,
      "image": "Outfits/Full/Alternate/Outfit_100_Outrider_Portrait.png",
      "thumbnail": "Outfits/Thumbnail/Alternate/Item_100_Outrider.png",
      "wishimage": "Outfits/Wish/Alternate/Outfit_100_Outrider_Preview.png",
      "3dmodel": null,
      "description": "Amber's outfit. This is a more formal — but no less cool — version of the Outrider's uniform!",
      "obtained": "Obtaining Character, In-Game Mail (During Version 2.4)",
      "lore": "In the last three months, Amber has had a bone or three to pick with Wolfhooks. While out scouting, her uniform and stockings were torn by their sharp hooks, and unfortunately, her schedule was such that there was no time to get them fixed.\nThe Knights' logistics division gave her 3 sets of uniform of the same type initially, so wearing one out was not exactly a major emergency. But Amber loved those three sets quite dearly, and would have been quite upset regardless of which one was torn.\nEven Baron Bunny had his design based on these uniforms — Amber recalled, with a twinge of sadness.\n\nSo when her mission ended, Amber would attempt to sew the damaged uniform back together, but despite her excellent skills, the marks of her needlework remained stitched into the fabric.\nHowever, Amber would obtain a new uniform not half a month at the Knights' end-of-year meeting.\nIt was a fair bit more official, the craft was more ornate... And it was also stated to be more hook-proof than the previous version.\n\"On behalf of the Knights of Favonius, I'd like to present you, our one and only Outrider, with some new clothes! Thanks for all you've done for us so far\". So Hertha, their logistics captain, had said.",
      "type": "Alternate",
      "shop": false,
      "shop_cost": 0,
      "shop_cost_discounted": 0,
      "shop_cost_discounted_till": null,
      "event_give_free": false,
      "event_give_free_till": null,
      "released_version": 2.4,
      "released": true,
      "wiki": "https://genshin-impact.fandom.com/wiki/100%25_Outrider",
      "subCollection": {}
    },
    "Gunnhildrs_Legacy": {
      "name": "Gunnhildr's Legacy",
      "character": "Jean",
      "characters": ["Jean"],
      "rarity": 4,
      "image": "Outfits/Full/Alternate/Outfit_Gunnhildrs_Legacy_Portrait.png",
      "thumbnail": "Outfits/Thumbnail/Alternate/Item_Gunnhildrs_Legacy.png",
      "wishimage": "Outfits/Wish/Alternate/Outfit_Gunnhildrs_Legacy_Preview.png",
      "3dmodel": null,
      "description": "Jean's outfit. This classic knight's ceremonial outfit is suited to all manner of occasions.",
      "obtained": "Obtaining Character, In-Game Mail (During Version 2.4)",
      "lore": "\"Big Sis, these clothes are yours, right? I found them while sorting things out in the room...\"\nThe folded ceremonial clothes in Barbara hands had the Knights' crest on it, which shone with a golden light as it caught the sun's rays.\nIt looked familiar, true, but Jean was very sure that she had never owned such a set of clothes before.\nCome to think of it, the uniform she usually wore was hand-sewn by her mother.\n\"Wait... could that be yours, Mother\"?\n\nFrederica smiled as her daughter asked this question — a rare sight to see on her face.\n\"Ah, it's been so long. So, Seamus still kept it, huh\"?\n\"Those were the clothes I wore when they granted me the title of 'Alder Knight.' You can take them, if you don't mind\".\nThe seedlings of yesteryear have grown strong, and with their shade they shelter the land they know so well.\nThe glories of the past have been passed on, and they shine every brighter for it.\nThey saluted each other first as knights would — then immediately embraced as only family long-overdue for a reunion might.",
      "type": "Alternate",
      "shop": false,
      "shop_cost": 0,
      "shop_cost_discounted": 0,
      "shop_cost_discounted_till": null,
      "event_give_free": false,
      "event_give_free_till": null,
      "released_version": 2.4,
      "released": true,
      "wiki": "https://genshin-impact.fandom.com/wiki/Gunnhildr%27s_Legacy",
      "subCollection": {}
    },
    "Pact_of_Stars_and_Moon": {
      "name": "Pact of Stars and Moon",
      "character": "Mona",
      "characters": ["Mona"],
      "rarity": 4,
      "image": "Outfits/Full/Alternate/Outfit_Pact_of_Stars_and_Moon_Portrait.png",
      "thumbnail": "Outfits/Thumbnail/Alternate/Item_Pact_of_Stars_and_Moon.png",
      "wishimage": "Outfits/Wish/Alternate/Outfit_Pact_of_Stars_and_Moon_Preview.png",
      "3dmodel": "Mona_Alt.glb",
      "description": "Mona's outfit. A costume made specifically to encompass the astrological concept of \"the destined moment\", thanks to the 30% discount ticket she got from the planetarium refund.",
      "obtained": "Obtaining Character, In-Game Mail (During Version 2.4)",
      "lore": "By the time you arrived at Starsnatch Cliff, Mona had already been waiting for you for some time.\nShe was looking up at the starry sky, a song you did not recognize on her lips. As you approached, a sudden urge to prank her came over you... But even as you crept up, angling to clap her on the shoulder, she stopped singing.\n\"If you were trying to scare me, I'm afraid you're too late.\"\n\nAh, as one might have expected from Mona Megistus, the Astrologist. Your attempt failed, you could only sit beside her. Clearing her throat, Mona began to speak in a professorial tone—\n\"The stars are truly lovely today, making this a fine night to watch the sky. And now that I've convinced the couple who are usually here to leave, this is now the perfect spot to conduct our class on the 'Basics of Astrology.'\"\nHuh. So that's why you hadn't seen Marvin or Marla.\n\"Then let's begin.\"\n\"'Astrology' is an umbrella term for the study of the laws that govern the movements of matter. The celestial bodies are but a shallow subject of research in this regard...\"\nYou understood the basic preamble just fine, but as she continued to speak, the topic grew more complicated, and you started to lose the plot. Still, she spoke so enthusiastically about the subject that you could not bring yourself to interrupt.\nLooking at her bright gray eyes and her constant gesticulations, you couldn't help but feel some embarrassment... Wait a moment.\n\"Did you change your clothes?\"\nSeeming to not expect your question, she seemed a little put on the spot at first, though she recovered quickly.\n\"That's right. I'm wearing these new clothes just to commemorate this momentous occasion as your astrology teacher. You can take this as a sign of... uh, respect\".\nFeeling a little guilty, you told yourself to get serious. Slapping the sagging, sleeping cheeks of yours, you forced your eyes open and continued listening to her lecture.\n\"The laws of matter are actually very simple. Rather, it is the principles that govern humanity that are the most complex. As such, we astrologists...\"\nAll the while, you thought to yourself, don't fall asleep, don't fall asleep, don't... Zzz...\n\"Heh. What am I going to do with you...\" Your astrology master mutters.",
      "type": "Alternate",
      "shop": false,
      "shop_cost": 0,
      "shop_cost_discounted": 0,
      "shop_cost_discounted_till": null,
      "event_give_free": false,
      "event_give_free_till": null,
      "released_version": 2.4,
      "released": true,
      "wiki": "https://genshin-impact.fandom.com/wiki/Pact_of_Stars_and_Moon",
      "subCollection": {}
    },
    "To_the_Churchs_Free_Spirit": {
      "name": "To the Church's Free Spirit",
      "character": "Rosaria",
      "characters": ["Rosaria"],
      "rarity": 4,
      "image": "Outfits/Full/Alternate/Outfit_To_the_Churchs_Free_Spirit_Portrait.png",
      "thumbnail": "Outfits/Thumbnail/Alternate/Item_To_the_Churchs_Free_Spirit.png",
      "wishimage": "Outfits/Wish/Alternate/Outfit_To_the_Churchs_Free_Spirit_Preview.png",
      "3dmodel": null,
      "description": "Rosaria's outfit. This seems to have been custom-made for her by the Church.",
      "obtained": "Obtaining Character",
      "lore": "\"Oh, come on! Everyone got this just for you!\"\nBarbara happily passed a wonderfully wrapped gift box to Rosaria, even as the latter looked on with a mix of suspicion and annoyance.\n\nTearing the packaging open, she found a note on the box cover across which elegant script flowed like music.\n\"Dear Sister Rosaria, we have asked Ms. Barbara to send this gift to you, but please, do open it somewhere where she can't see you.\"\n\nOpening the box with her back turned, Rosaria discovered that the box contained still another note. It was thusly written in the same hand as before:\n\"Dear Sister Rosaria, we know that you don't appreciate having too many people know your birthday. However, this piece of information was written on your resume by Grandmaster Varka, so, on this important day, do allow the Church of Favonius to send you a new uniform, made just for you.\"\n\"If you're alright with it, stop being so aloof and be a normal Sister for once.\"\n\nDeacon Dahlia (This letter was written at the request of Sister Victoria)",
      "type": "Alternate",
      "shop": false,
      "shop_cost": 0,
      "shop_cost_discounted": 0,
      "shop_cost_discounted_till": null,
      "event_give_free": false,
      "event_give_free_till": null,
      "released_version": 2.4,
      "released": true,
      "wiki": "https://genshin-impact.fandom.com/wiki/To_the_Church%27s_Free_Spirit",
      "subCollection": {}
    },
    "Toward_the_Distant_Horizon": {
      "name": "Toward the Distant Horizon",
      "character": "Durin",
      "characters": ["Durin"],
      "rarity": 4,
      "image": null,
      "thumbnail": "Outfits/Thumbnail/Alternate/Item_Toward_the_Distant_Horizon.png",
      "wishimage": "Outfits/Wish/Alternate/Character_Durin_Toward_the_Distant_Horizon_Full_Wish.png",
      "3dmodel": null,
      "description": "Durin's outfit. Durin's original outfit has received a new lease of life now that he's taken up his mother's pen. Ultimately, he bid farewell to the past once painted by its previous owner. When the lock on his heart faded away, the distant horizon his wish now points to became the direction in which his story continues to unfold.",
      "obtained": "Complete Durin's Story Quest, Draco Rubedo Chapter: Act I - The Magic Known as Storytelling",
      "lore": "What do you suppose would be a writer's greatest regret?\n\"To... leave a story without an ending?\"\nSuch was Alice's reply, as one who had been touched by such regret all too often in her sojourns across many worlds.\nAn author who had toiled for decades might suddenly pass away due to acute illness, leaving an epic tale of swords and sorcery frozen before the final battle... Or perhaps a brilliantly gifted author, their time limited by some malady, may find themselves never able to fully present their grand imagined world to their readers...\nAlice, who loved reading, was deeply troubled by this and couldn't help but sigh.\n\"My greatest regret is that every story I write has to come to an end in the first place.\"\nThis was the answer that Anya \"Marie\" Andersdotter, one who had authored many a fairy tale, gave.\nShe glanced back at the bookshelf, where many characters born from her pen slumbered between the pages. Some were clever or brave, winning the hearts of many readers with their outstanding performances.\nBut no matter how brilliantly a character shines, the moment their story ends, their potential is lost forever.\nFor them, the story itself becomes an inescapable fate.\nLooking at the books, now covered in a thin layer of dust from being sealed away for so long, Alice understood her friend's regret.\n\"Anya...\"\n\"But what if instead, I could place my pen in their hand and let them continue the story themselves?\"\nAnya's gaze returned to the manuscript — the last story she would leave behind, and the most special. Other stories would eventually form part of the \"past,\" but this story could have a \"future.\"\nAlice quickly understood that this was her friend's final wish.\n\"...What the writer you are, Anya. Your imagination never ceases to amaze.\"\n\"And you do know how much I love a happy ending. You shall have my help, my dear.\"",
      "type": "Alternate",
      "shop": false,
      "shop_cost": 0,
      "shop_cost_discounted": 0,
      "shop_cost_discounted_till": null,
      "event_give_free": false,
      "event_give_free_till": null,
      "released_version": 6.2,
      "released_version_name": "Luna III",
      "released": true,
      "wiki": "https://genshin-impact.fandom.com/wiki/Toward_the_Distant_Horizon",
      "subCollection": {}
    }
  }
}