{
  "outfits": {
    "Sea_Breeze_Dandelion": {
      "name": "Sea Breeze Dandelion",
      "character": "Jean",
      "rarity": 4,
      "image": "Outfits/Full/Themed/Outfit_Sea_Breeze_Dandelion_Portrait.png",
      "thumbnail": "Outfits/Thumbnail/Themed/Item_Sea_Breeze_Dandelion.png",
      "wishimage": "Outfits/Wish/Themed/Outfit_Sea_Breeze_Dandelion_Preview.png",
      "3dmodel": "Jean_Summer.glb",
      "description": "Jean's summer wear. Light and cool, but no less elegant for it. The perfect choice for a trip to the seaside.",
      "obtained": "Character Outfit Shop",
      "lore": "The Acting Grand Master's life runs like the gears of a machine, driven by the great force of heavy responsibility, constantly being ground down by work.\nOver time, the armor of chivalry has become like Jean's second skin, the presentation of proper dress code and a formal image becoming ever more firmly forged into her nature.\nBut in truth, Jean is no older than the ordinary young women around her.\n\nIn the novels that these young ladies enjoy, gorgeous gowns are as quintessential as sun, moon, and starlight themselves, and some opulent noble scions do indeed sit pretty in dresses that sprawl out like palaces, their hem-lines and long skirts intertwined like the lapping waves of the sea.\nPerhaps Jean once had such romantic aspirations too. After all, who has never hankered after the blissful beauty of luxury?\n\nBut now, Jean has had her wish granted with a set of form-fitting summer wear made just for her — and this one item has far surpassed any number of beauteous dresses that appeared in her novels.\n\"I heard that the original idea was Barbara's and that she and Lisa searched every store before deciding on the most suitable design.\"\n\"Then Kaeya was somehow able to convince Master Diluc to hire craftsmen to make some modifications...\"\n\"...With fabric chosen by Amber out of her experience with making Baron Bunnies, to render it comfortable but relatively inexpensive...\"\n\"...And with gems for decoration picked from Albedo and Klee's collections.\"\n\"The tailoring was then overseen by Noelle, right down to the last needle and thread...\"\n\"...And the detailed dimensions were provided by Lisa, who even sewed this lovely rose ornament on personally...\"\nThis gift, made for her by everyone, was the loveliest surprise she had ever had.\n\nIf her previous holiday was a tiny respite amidst a sea of work, this seaside trip was an unexpected opportunity to fully relax.\nHaving laid her armor aside, she now shimmered in the sea's light like a twirling dandelion.\n\"This... is the first time I've ever had such a relaxing summer holiday.\"",
      "type": "Summer",
      "shop": true,
      "shop_cost": 1680,
      "shop_cost_discounted": 1350,
      "shop_cost_discounted_till": "19-7-2021",
      "event_give_free": false,
      "event_give_free_till": null,
      "released_version": 1.6,
      "released": true,
      "wiki": "https://genshin-impact.fandom.com/wiki/Sea_Breeze_Dandelion",
      "subCollection": {}
    },
    "Summertime_Sparkle": {
      "name": "Summertime Sparkle",
      "character": "Barbara",
      "rarity": 4,
      "image": "Outfits/Full/Themed/Outfit_Summertime_Sparkle_Portrait.png",
      "thumbnail": "Outfits/Thumbnail/Themed/Item_Summertime_Sparkle.png",
      "wishimage": "Outfits/Wish/Themed/Outfit_Summertime_Sparkle_Preview.png",
      "3dmodel": "Babara_Summer.glb",
      "description": "Barbara's beach attire. This pretty skirt brims with summer vitality and carries with it a cool ocean breeze.",
      "obtained": "Character Outfit Shop, Echoing Tales Event",
      "lore": "Barbara's songs and dances are meant to heal everyone's hearts.\nBut sometimes, even Barbara, who brings smiles onto everyone's faces, will herself feel down.\nShe, too, wishes to hang out with close friends and spend quality time with her family, much like any other girl her age.\nThese small wishes seem simple to anyone else, but they are a luxury for Barbara.\n\nAs an idol, she is often surrounded by zealous fans when she goes out.\nAnd when she can steal moments to be with her family, the time she can spend with her parents and sister is ever so brief.\nHer brilliant, busy sister is often stuck to her desk due to official business, and every time Barbara wants to go to her to share her feelings, she is silenced by the mountain of work piled in front of Jean.\n\nHer sister's exhaustion is plain to see, and Barbara sees it too.\nIt can't be helped: Jean Gunnhildr is everyone's Acting Grand Master.\n\"But... could you just... give me my sister back, just for a while?\"\nBarbara says this to herself while watching her busy sister.\n\nAnd that was when she heard a rumor about a strange archipelago.\nSummer, islands, the ocean... could this be her hard-come-by opportunity?\nSummer meant refreshing drinks, sweet icy desserts, and golden sands, azure seas, and people playing in the water.\nThe sand... the sea... Yes! So it was decided.\n\nBut a seaside trip requires preparation.\nSnacks, sweets... ah yes, and Spicy Dried Fish, too. All this, she placed into her cute yellow ducky bag. ♪\nOh, and let's not forget clothes! I'll need some light and comfy swimwear. This short skirt looks good — and those little white flowers lend a playful look to those shoes! ♪\nAnd perhaps a little bow tied around the neckline, would that look cuter?\nBarbara began to hum happily to herself: La~ la la la la~ la la! ♪\n\nBut there was no way her sister would have time to prepare any swimwear for herself, would she?\nThat was quite the pickle... Still, there were ways around that.\nBarbara pushed the door of the library open with a smile. \"Do you have time, Miss Lisa? I'd like your help with picking a set of clothes.\"",
      "type": "Summer",
      "shop": true,
      "shop_cost": 1680,
      "shop_cost_discounted": 0,
      "shop_cost_discounted_till": null,
      "event_give_free": true,
      "event_give_free_till": "21-7-2021",
      "released_version": 1.6,
      "released": true,
      "wiki": "https://genshin-impact.fandom.com/wiki/Summertime_Sparkle",
      "subCollection": {}
    },
    "Red_Dead_of_Night": {
      "name": "Red Dead of Night",
      "character": "Diluc",
      "rarity": 5,
      "image": "Outfits/Full/Themed/Outfit_Red_Dead_of_Night_Game.png",
      "thumbnail": "Outfits/Thumbnail/Themed/Item_Red_Dead_of_Night.png",
      "wishimage": "Outfits/Wish/Themed/Outfit_Red_Dead_of_Night_Preview.png",
      "3dmodel": "Diluc_Summer.glb",
      "description": "One of the outfits Diluc wears during covert actions, it resembles a flame dancing in the shadows.\nThe crimson red traces it leave behind at the edges of the enemy's vision will scar their nightmares forever.",
      "obtained": "Character Outfit Shop",
      "lore": "As the eldest son of the Ragnvindr Clan and the youngest Cavalry Captain in the history of the Knights of Favonius, much was always expected of Diluc, who grew up surrounded by plaudits and applause. Even the carefree Knight of Boreas, Varka, praised him, calling him \"the pride of the Knights.\"\nThis was a matter of great comfort to his father, Crepus, who hoped that Diluc would be more successful than him. Not only would he bring dawn to Mondstadt as a member of the Ragnvindr Clan, but he would also become an excellent Knight of Favonius, standing at the apex of the crowd, inheriting and passing its noble traditions down.\nThis expectation would bleed into their conversations, into training, and into every little detail of life, with the proud father even having a ceremonial uniform tailored for Diluc well in advance.\nYet, for Diluc, his father's praises and his life as a knight were extinguished forever on that gloomy, rainy night, and the ceremonial garment thus lost its purpose.\nMany years later, the tragedy and the uproar had finally stabilized. Returning home, Diluc began his journey of \"reckoning.\"\nThis was not merely for his father's sake, but also on account of the convictions he had suffered much to gain. He would protect Mondstadt in his own way.\nThe ceremonial uniform of yesteryear was modified to serve as new cladding for battle. The fabric itself was familiar yet had the feeling of long-separation, and Diluc privately treasured it.\n\"That's my boy.\" Looking upon the gem around the neck that reflected his red hair, he recalled his father saying that.\nOn silent nights, the edge hidden under the velvet glove of the noble princeling will be unsheathed to counter any threat. And wherever the blade passed, wherever the claymore's arc flashed, raging flames would arise and burn the hidden nests of villainy to the ground.\nBy the time the name of the Darknight Hero had become well known to the people of Mondstadt, the red so striking that it might sear the eyes had long become a thing of awe and terror to monsters and crooks alike.\n\"The true dawn has yet to come.\"\nContrary to his father's expectations, Diluc knew that he must instead be a \"forerunner.\"",
      "type": "Themed",
      "shop": true,
      "shop_cost": 2480,
      "shop_cost_discounted": 1980,
      "shop_cost_discounted_till": "22-8-2022",
      "event_give_free": false,
      "event_give_free_till": null,
      "released_version": 2.8,
      "released": true,
      "wiki": "https://genshin-impact.fandom.com/wiki/Red_Dead_of_Night",
      "subCollection": {}
    },
    "Orchids_Evening_Gown": {
      "name": "Orchid's Evening Gown",
      "character": "Ningguang",
      "rarity": 4,
      "image": "Outfits/Full/Themed/Outfit_Orchids_Evening_Gown_Portrait.png",
      "thumbnail": "Outfits/Thumbnail/Themed/Item_Orchids_Evening_Gown.png",
      "wishimage": "Outfits/Wish/Themed/Outfit_Orchids_Evening_Gown_Preview.png",
      "3dmodel": "Ningguang_Lunar.glb",
      "description": "Ningguang's formal wear. The long cyan skirt traces her elegant curves, and the butterfly wings at her ankles lend the outfit a touch of light grace.",
      "obtained": "Character Outfit Shop, Fleeting Colors in Flight Event",
      "lore": "Ningguang, the great mover and shaker of Liyue's mercantile spheres, always seems to have a confident, steady smile on her face.\nBut even she cannot escape the vagaries of depression, reluctance, loneliness, and other anxieties that trouble the ordinary people of Liyue.\nOnce, when Liyue Harbor teetered on the brink of a crisis, Ningguang was forced to sacrifice her Jade Chamber — the sky palace she had built up for many years through much sweat and tears.\nAll the memories of her past, sweet or bitter, were cast into the ocean with the Jade Chamber, and there they sank. Even one such as Ningguang could nary bear the loss.\nEven after the dust had settled and the opportunity to rebuild the Chamber came, she still spent much time in troubled consideration.\nMany things happen in this world — who could say when great loss might loom?\nEach time she thought on this, she would feel depressed.\n\nAs the banquet in the skies began anew, Ningguang stepped forward in her indigo dress to invite the gathered guests to celebrate with her.\nYet amid the revelry, amidst the sea of famous relics, precious trinkets, fine cuisine, and the cries of joy and laughter,\nLiyue's Tianquan was once again gripped by melancholy.\n\nLeaving her seat, she stood under the night sky with a clouded heart.\nThe sounds of cheer within the pavilion could no longer be heard from this far away — it was as if she were alone under the stars.\nAs she often would in past, she gazed down at Liyue beneath her feet—\nThe faint moonlight seemed to be cast about Liyue's face like a veil. From Bishui Plain to Lisha, the land was painted a magnificent, gentle white.\nThis was a sight that Ningguang was most familiar with. Ever since the Jade Chamber was completed, she would gaze upon this majestic view every night.\nTime flies, but the mountains and seas remain.\n\n\"The mortal world is fleeting, but there are things that will not change so easily.\"\n\"A hundred years from now, perhaps, all things might be different. But then, my beauty would have faded, my body reduced to withered bones.\"\n\"This garment, too, will by then have grown dull, no matter how opulent it may have been in its prime.\"\n\"But so long as I live, riches uncounted shall be at my disposal, as shall the Tianquan's authority, so vested in me.\"\n\"I will live this life to the full — lacking not at all for power, wealth, or friends.\"\n\"Was this not what I resolved to do from the beginning? If so, then how could I simply allow myself to fall into this pit — to lose my wits because of a moment's emptiness?\"\n\"Life must be treasured precisely because it is fleeting.\"\n\"But a thousand, even ten thousand years from now, those who come after will remember this name — Ningguang.\"\n\nAs she returned to the feast, her heart was clear.\nAnd when she emerged before the crowd again, the Tianquan Ningguang wore that calm, self-assured smile once more.",
      "type": "Formal",
      "shop": true,
      "shop_cost": 1680,
      "shop_cost_discounted": 0,
      "shop_cost_discounted_till": null,
      "event_give_free": true,
      "event_give_free_till": "12-2-2022",
      "released_version": 2.4,
      "released": true,
      "wiki": "https://genshin-impact.fandom.com/wiki/Orchid%27s_Evening_Gown",
      "subCollection": {}
    },
    "Ein_Immernachtstraum": {
      "name": "Ein Immernachtstraum",
      "character": "Fischl",
      "rarity": 4,
      "image": "Outfits/Full/Themed/Outfit_Ein_Immernachtstraum_Game.png",
      "thumbnail": "Outfits/Thumbnail/Themed/Item_Ein_Immernachtstraum.png",
      "wishimage": "Outfits/Wish/Themed/Outfit_Ein_Immernachtstraum_Preview.png",
      "3dmodel": "Fischl_Summer.glb",
      "description": "A ceremonial outfit for the Prinzessin. May she who is noble retain her courage, sincerity, and kindness forever, such that no evil shall ever overcome her.",
      "obtained": "Character Outfit Shop, Resonating Visions Event",
      "lore": "—Curtains Rise—\nO holiest of sovereigns, high princess of Immernachtreich!\n\nPraise her eminent rule, extol her magnanimous judgement, exalted be her rosy visage.\n\nThe thunder roars for her, and for her are towers built.\n\nThe fief-lords of Immernachtreich and The Great Sekretär, most loyal Osvaldo Hrafnavins, gather here to await her command.\n\nAnd her knights, silent and stern as the majestic mountains.\n\nThe first, the Knight of Valor, armed with a sword of keenness unmatched, yea, enough to sunder dragonscale.\n\nThe second, the Knight of Sincerity, shod in armor true, enough to withstand the storm of a dragon's wings.\n\nThe third, the Knight of Charity, righteous and pure in all ways, who quailed not before any darkness.\n\nAnd the other knights gathered behind them, their heads bowed beneath the tower summit, gathered at their Prinzessin's feet.\n\nAnd as for the Prinzessin, she withdrew her gaze from the deep night before addressing her servants:\n\n\"Valor, Sincerity, Charity, my most excellent subjects. Follow me unto eternity.\"\n\n\"For I am the noblest soul in all the Immernachtreich. So long as my heart beats, I shall never forsake you.\"\n\nAnd the knights obeyed her:\n\n\"Our swords and armor are yours. May they be for you a means to break all shackles and guard against all corruption.\"\n\n\"Our true hearts also we give unto you, that they may defend your noble soul.\"\n\nThis was their knightly oath, and they would be by her side as she hunted the wicked dragon Tasraque.\n\nFor far away, black-hearted Tasraque had ripped and devoured the all-protecting night sky and set up its lair.\n\nIt had slithered in the dark, sharpening its fangs and claws, and with its flaming breath it had scorched the Prinzessin's heart, turning her eyes red.\n\nThis was the Prinzessin's fated foe, and their showdown was inevitable.\n\nBut the prophecy of fate has already been foretold. Fair and pure souls need not fret.\n\nSimply open one's eyes and prepare to bear witness, for she shall surely return victorious.\n\n—Curtains Fall—\nNote: According to Flowers for Princess Fischl, Princess Fischl has \"crimson eyes like rubies.\" The actor who plays her is thus advised to make the necessary performative adjustments to maintain faithfulness to the source material.",
      "type": "Themed",
      "shop": true,
      "shop_cost": 1680,
      "shop_cost_discounted": 0,
      "shop_cost_discounted_till": null,
      "event_give_free": true,
      "event_give_free_till": "24-8-2022",
      "released_version": 2.8,
      "released": true,
      "wiki": "https://genshin-impact.fandom.com/wiki/Ein_Immernachtstraum",
      "subCollection": {}
    },
    "Opulent_Splendor": {
      "name": "Opulent Splendor",
      "character": "Keqing",
      "rarity": 4,
      "image": "Outfits/Full/Themed/Outfit_Opulent_Splendor_Portrait.png",
      "thumbnail": "Outfits/Thumbnail/Themed/Item_Opulent_Splendor.png",
      "wishimage": "Outfits/Wish/Themed/Outfit_Opulent_Splendor_Preview.png",
      "3dmodel": "Keqing_Lunar.glb",
      "description": "Keqing's formal wear. Amidst the beautiful dawn of the Lantern Rite, the threads weaved by days of hard work intertwine into a light yet magnificent appearance.",
      "obtained": "Character Outfit Shop",
      "lore": "Satins with an exquisite texture weaved with ancient techniques and made from carefully selected petals of half-blooming Silk Flowers; dye extracted from Violetgrass of purest mulberry, ideal for recreating the ethereality of ancient paintings; something Liyue and something exotic fused together to create a unique style, with interlaced threads sewn through a hundred days of work, fine like gossamer brush strokes across a canvas.\nThe dress is perhaps Keqing's most luxurious outfit. The story behind it is also rather fascinating—\nSince her first day as the Yuheng, she has never enjoyed its privileges but has instead devoted much private time to her duty. To improve work efficiency, Keqing prefers a dressing style that prioritizes practicality and only keeps a minimum level of embellishment. Therefore, though like a flower she blooms, she used to dress simple.\nHowever, working closely with Ganyu and then Ningguang has given Keqing a sort of epiphany—\nKeqing accepts that she cannot work day and night like the half-adeptal secretary Ganyu. She also knows Ningguang's way well, who often takes a bath after work to withdraw from the moment. By temporarily putting the crazy agenda aside for the next day, Ningguang thus allows herself to fully relax.\nKeqing understands that to lead the tide of change requires not impatient leaps and bounds but care for one's body and mind. Good maintenance keeps one going smoothly.\nNingguang also gave Keqing similar advice:\n\"You've never donned anything special for festivals, and people are used to your image as it is. But Liyue is different now. If you show up in front of the public in a new look, it will add to the merrymaking and inspire everyone greatly.\"\nKeqing was aware of that, but she just wanted to transform silently so that she wouldn't worry her colleagues.\nHer attire for the Lantern Rite would serve as a good start.\n\"This attire marks the line between my work and life. By striking a balance between the two, I will find a comfortable pace at which I shall lead the way into a new Liyue.\"\nHaving made up her mind, Keqing had Ningguang's personal tailor make her a dress that still keeps luxury to a minimum. With the attire finished, Keqing threw herself back into the preparations for the Lantern Rite.\nAs for how she ended up overworking herself again, accidents like that do happen, occasionally.\nWhile conversing with the Traveler again in the Jade Chamber, their caring advice reminded Keqing of the decision she had made not long ago. A faint smile formed on her face.\nPerhaps this is what they call the tacit understanding between ideal companions, who are always on the same page.\nShe put on the long-readied attire and spoke gently to the Traveler, who looked her way. Having received generous praises, she turned to the blooming fireworks.\nThe light of festive fireworks set her dress aglow like a star in a dark night. The hem of her dress danced at her steps like flowers flowing in a gentle breeze.",
      "type": "Formal",
      "shop": true,
      "shop_cost": 1680,
      "shop_cost_discounted": 1350,
      "shop_cost_discounted_till": "14-2-2022",
      "event_give_free": false,
      "event_give_free_till": null,
      "released_version": 2.4,
      "released": true,
      "wiki": "https://genshin-impact.fandom.com/wiki/Opulent_Splendor",
      "subCollection": {}
    },
    "A_Sobriquet_Under_Shade": {
      "name": "A Sobriquet Under Shade",
      "character": "Lisa",
      "rarity": 4,
      "image": "Outfits/Full/Themed/",
      "thumbnail": "Outfits/Thumbnail/Themed/",
      "wishimage": "Outfits/Wish/Themed/",
      "3dmodel": null,
      "description": "An outfit Lisa had someone commission for her when she revisited Sumeru. A perfect balance between practicality and elegance, the dress bears a resemblance to Lisa's old uniform from the Akademiya days.",
      "obtained": "Character Outfit Shop, Second Blooming Event",
      "lore": null,
      "type": "Themed",
      "shop": true,
      "shop_cost": 1680,
      "shop_cost_discounted": 0,
      "shop_cost_discounted_till": null,
      "event_give_free": true,
      "event_give_free_till": null,
      "released_version": 3.4,
      "released": false,
      "wiki": "https://genshin-impact.fandom.com/wiki/A_Sobriquet_Under_Shade",
      "subCollection": {}
    },
    "Springbloom_Missive": {
      "name": "Springbloom Missive",
      "character": "Kamisato_Ayaka",
      "rarity": 4,
      "image": "Outfits/Full/Themed/",
      "thumbnail": "Outfits/Thumbnail/Themed/",
      "wishimage": "Outfits/Wish/Themed/",
      "3dmodel": null,
      "description": "Ayaka's travel outfit. Its design is based on the Fontaine dresses depicted in light novel illustrations and seems to reflect the lifestyle of proper ladies who live in that nation.",
      "obtained": "Character Outfit Shop",
      "lore": null,
      "type": "Travel",
      "shop": true,
      "shop_cost": 1680,
      "shop_cost_discounted": 1350,
      "shop_cost_discounted_till": null,
      "event_give_free": false,
      "event_give_free_till": null,
      "released_version": 3.4,
      "released": false,
      "wiki": "https://genshin-impact.fandom.com/wiki/Springbloom_Missive",
      "subCollection": {}
    }
  }
}